Public Attributes | List of all members
API_CurtainWallType Struct Reference
Element Manager
Represents a Curtain Wall element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_ZoneRelID  | zoneRel
Relation to zones. See API_ZoneRelID.
 short  | pen
The pen index.
 double  | nominalWidth
Nominal width of the Curtain Wall.
 bool  | flipped
The curtain wall is flipped.
 double  | offset
Panel offset to the reference plane.
 double  | distanceInside
Theoretical border of the curtain wall.
 double  | distanceOutside
Theoretical border of the curtain wall.
 API_CWBoundaryFramePosID  | boundaryFramePosition
Boundary Frame position.
 API_LinkToSettings  | linkToSettings
Link to story settings. See API_LinkToSettings.
 API_StoryVisibility  | visibility
Story visibility. See API_StoryVisibility.
 bool  | isAutoOnStoryVisibility
Story visibility will be automatically recalculated when needed.
 double  | storyRelLevel
Base level (relative to home story).
 API_ElemDisplayOptionsID  | displayOption
Floor plan display option. See API_ElemDisplayOptionsID.
 API_ElemProjectionModesID  | cutProjectionMode
Cut projection mode. See API_ElemProjectionModesID.
 API_ElemProjectionModesID  | uncutProjectionMode
Uncut projection mode. See API_ElemProjectionModesID.
 API_ElemProjectionModesID  | overheadProjectionMode
Overhead projection mode. See API_ElemProjectionModesID.
 API_ElemViewDepthLimitationsID  | viewDepthLimitation
Floor plan view depth limitation. See API_ElemViewDepthLimitationsID.
 API_AttributeIndex  | overheadLineType
Linetype of view above cutplane on the floorplan.
 short  | overheadLinePen
Pen index of view above cutplane on the floorplan.
 short  | uncutLinePen
Pen index of view below cutplane on the floorplan.
 API_AttributeIndex  | uncutLineType
Linetype of view below cutplane on the floorplan.
 API_AttributeIndex  | frameCutLineType
Line index of the cut part of frames on the floorplan.
 short  | frameCutLinePen
Pen index of the cut part of frames on the floorplan.
 short  | panelCutLinePen
Pen index of the cut part of panels on the floorplan.
 API_AttributeIndex  | panelCutLineType
Line index of the cut part of panels on the floorplan.
 bool  | useFrameTypesAttributes
Use Frame type's attributes.
 bool  | usePanelTypesAttributes
Use Panel type's attributes.
 API_OverriddenPen  | cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
 API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
 API_CWPlacementID  | placementMethod
Placement method.
 API_CWSegmentType  | segmentData
Curtain Wall Segment related data.
 API_CWFrameType  | cornerFrameData
Parameters of corner frames.
 API_CWFrameType  | boundaryFrameData
Parameters of boundary frames.
 API_CWJunctionType  | junctionData
Parameters of junctions.
 API_CWAccessoryType  | accessoryData
Parameters of glass accessories.
 double  | angle
Angle of the curtain wall (input only).
 double  | height
Height of the curtain wall (input only).
 API_Polygon  | polygon
Base polygon of the curtain wall.
 API_Tranmat  | planeMatrix
Plane matrix of the curtain wall.
 double  | planeOffset
Plane offset of the curtain wall.
 UInt32  | nSegments
Number of segments.
 UInt32  | nFrames
Number of frames.
 UInt32  | nFrameDefaults
Number of custom frame classes (Corner Frame and Boundary Frame Classes are not included).
 UInt32  | nPanels
Number of panels.
 UInt32  | nPanelDefaults
Number of panel classes.
 UInt32  | nJunctions
Number of junctions.
 UInt32  | nAccessories
Number of accessories.
Detailed Description
Represents a Curtain Wall element.
Remarks
The Curtain Wall is a hierarchical (system) element consisting of Frame, Panel, Accessory and Junction components: these are the Members of the Curtain Wall, arranged on a Base Surface according to a pre-defined scheme. By default all CW component is generic and has built from the owner elem. The elements' cut fill foreground and background pens inherit from the building material, and can be overridden on the element level. In Archicad 22, the Frames and Panels of a Curtain Wall element are no longer forced into primary/secondary or glass/glazed categories, with the exception of Boundary Frames, which are still a separate category. As so, the other default Frame and Panel elements are found in the corresponding API_ElementMemo structure. Also, Curtain Wall subelements now contain their own library part identifiers instead of the Curtain Wall structure itself.